tutorials/validation/SIPM-SP/caseC/system/solid/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
T
    {
        solver           BiCGStab;
        preconditioner   DILU;

        minIter          0;
        maxIter          2000;
        tolerance        1e-7;
        relTol           0;
    }
}

SIMPLE
{
}
PISO
{
    nCorrectors         100;
   
}
relaxationFactors
{
    T               0.999999;
}


// ************************************************************************* //
